In [1]:
import pandas as pd
import pymongo

In [21]:
myclient = pymongo.MongoClient("mongodb://mongoadmin:admin@13.67.48.201:27017/")
mydb = myclient["LinkedIn"]
mycol = mydb["User_education"]
cursor = mycol.find()
items = list(cursor)

In [24]:
df = pd.DataFrame(items)
df

,_id,education
0,thanhdiep23,"[Sai Gon University,Master of Business Adminis..."
1,ACoAACGoyx8BN_W_i04AdC-kWSjlP3laMt2-ATo,"[Hanoi University of Business and Technology,A..."
2,trucnguyen1112,[Ho Chi Minh University of Social Sciences and...
3,ACoAAA4hY4YBg3-UH5yt-qQmQoySgGg5dVL4vX4,"[Technology University,Bachelor of Engineering..."
4,ACoAACdYwZwBgXSpz35E99EYMaUmdt-MtHMYe0Y,[]
...,...,...
6452,bonagirimahaveer,"[National Institute of Technology Durgapur,Bac..."
6453,sharmas1ddharth,[]
6454,laurapumpute,"[Free University of Bozen-Bolzano,Master's Deg..."
6455,tqhernandez,"[University of Mary Washington,Bachelor of Sci..."
6456,kevin-hew-19349513,"[University of Melbourne,Bachelor of Commerce ..."

In [25]:
for i in range(len(df)):
    temp_list = df.iloc[i]['education']
    after_list = []
    if len(temp_list) >0:
        for item in temp_list:
            if 'follower' in item:
                temp_list.remove(item)
                # break
    # print(df.iloc[i]['_id'],temp_list)
    df.iloc[i]['education'] = temp_list
    # print('\n')

In [26]:
df.iloc[25]['education']

["Hanoi Law University,Bachelor's degree, Economics Law"]

In [27]:
df

,_id,education
0,thanhdiep23,"[Sai Gon University,Master of Business Adminis..."
1,ACoAACGoyx8BN_W_i04AdC-kWSjlP3laMt2-ATo,"[Hanoi University of Business and Technology,A..."
2,trucnguyen1112,[Ho Chi Minh University of Social Sciences and...
3,ACoAAA4hY4YBg3-UH5yt-qQmQoySgGg5dVL4vX4,"[Technology University,Bachelor of Engineering..."
4,ACoAACdYwZwBgXSpz35E99EYMaUmdt-MtHMYe0Y,[]
...,...,...
6452,bonagirimahaveer,"[National Institute of Technology Durgapur,Bac..."
6453,sharmas1ddharth,[]
6454,laurapumpute,"[Free University of Bozen-Bolzano,Master's Deg..."
6455,tqhernandez,"[University of Mary Washington,Bachelor of Sci..."
6456,kevin-hew-19349513,"[University of Melbourne,Bachelor of Commerce ..."

In [28]:
# import pymongo
myclient = pymongo.MongoClient("mongodb://mongoadmin:admin@13.67.48.201:27017/")
mydb = myclient["LinkedIn"]
mycol = mydb["User_educations"]
mycol.insert_many(df.to_dict('records'))